comsys/icmp.html
---
layout: page
title: Internet Control Message Protocol
---

<p>
<b>Router Solicitation</b> (dt. Router Anfrage): Werden von Hosts gesendet, um
die lokalen Router zu finden.
</p>

<p>
Next Hop Determination: Stelle fest ob das Zielsystem lokal ist oder nicht
</p>

<p>
Funktion:
</p>

<ul class="org-ul">
<li>Senden von Diagnoseinformationen an den Versender
</li>
<li>Erreichbarkeitstests z.B. hello requests
</li>
<li>&#x2026;
</li>
</ul>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Host Autoconfiguration</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>stateful: mit DHCP Server
</li>
<li>stateless: Client handlen ihr Konfiguration unterienander aus
</li>
</ul>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Stateless</h3>
<div class="outline-text-3" id="text-1-1">
<ol class="org-ol">
<li>DAD (duplicate adress detection): Erzeuge eine <i>tentative adress</i>
</li>
<li>Adress autoconfiguration: Prefix vom Router erhalten
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> ICMPv6</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Ersetzt DHCP und ARP.
</p>

<p>
<b>Neighbor Discovery Protocol</b> 
</p>

<p>
<b>Router Advertisement:</b> Werden vom Router verschickt &#x2026;
</p>

<p>
Funktionen:
</p>

<ul class="org-ul">
<li>Host-Router Discovery: Host kann lokale Router finden und
Informationen über das Netzwerk erhalten
</li>
<li>Host-Host Communicaton: Duplicate Address Detection, &#x2026;
</li>
<li>NDP Redirect Function: vom Router vesendet, um host über bessere
Routen zu bestimmten Endsystemen zu informieren.
</li>
</ul>
</div>
</div>
</div>
